import clsx from 'clsx';
import styles from './footer.module.scss';

export function Footer() {
  return (
    <footer id="contacts" className="section-pt">
      <div className="container">
        <h2 className={clsx(styles.title, 'h3 h-pb-sm')}>Контактные данные</h2>

        <div className={styles.content}>
          <h3 className="subtitle">
            г. Ставрополь, ул. Пирогова, 68А, офис 24
          </h3>
          <div className={styles.right}>
            <div className={styles.text}>
              <a href="tel:89283108445" className="subtitle">
                8 (928) 310-84-45
              </a>
              <a href="mailto:kpk-print@mail.ru" className="subtitle">
                kpk-print@mail.ru
              </a>
            </div>
            <div className={styles.social}>
              <a href="https://t.me/kpk_print" target="_blank">
                <TelegramIcon />
              </a>
              <a href="https://wa.me/79283108445" target="_blank">
                <WhatsappIcon />
              </a>
            </div>
          </div>
        </div>

        <div id="map"></div>
      </div>

      <div className={clsx(styles.bottom, 'info')}>
        <div className={clsx(styles.bottomContainer, 'container')}>
          <span>ИП Карпова Ольга Александровна</span>
          <span>ИНН 260707502721</span>
          <span>ОГРНИП 316265100142248</span>
        </div>
      </div>
    </footer>
  );
}

function WhatsappIcon() {
  return (
    <svg
      className={styles.whatsapp}
      width="40"
      height="41"
      viewBox="0 0 40 41"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M20 40.771C31.0457 40.771 40 31.8167 40 20.771C40 9.7253 31.0457 0.770996 20 0.770996C8.9543 0.770996 0 9.7253 0 20.771C0 31.8167 8.9543 40.771 20 40.771Z"
        fill="currentColor"
      />
      <path
        d="M27.927 12.834C26.9574 11.8622 25.8055 11.0915 24.5373 10.5658C23.2692 10.0402 21.9098 9.77011 20.537 9.771C14.757 9.771 10.073 14.438 10.073 20.198C10.073 22.021 10.585 23.844 11.463 25.375L10 30.771L15.561 29.313C17.098 30.115 18.781 30.553 20.537 30.553C26.317 30.553 31 25.886 31 20.125C30.927 17.427 29.902 14.802 27.927 12.834ZM25.585 23.917C25.365 24.5 24.341 25.083 23.829 25.157C23.2928 25.2394 22.7456 25.2146 22.219 25.084C21.854 24.938 21.341 24.792 20.756 24.5C18.122 23.406 16.439 20.781 16.293 20.563C16.146 20.417 15.195 19.177 15.195 17.865C15.195 16.553 15.854 15.969 16.073 15.677C16.293 15.386 16.585 15.386 16.805 15.386H17.317C17.463 15.386 17.683 15.313 17.902 15.823C18.122 16.333 18.634 17.646 18.707 17.719C18.7432 17.7861 18.7622 17.8612 18.7622 17.9375C18.7622 18.0138 18.7432 18.0889 18.707 18.156C18.634 18.302 18.561 18.448 18.415 18.594C18.268 18.74 18.122 18.958 18.049 19.031C17.902 19.177 17.756 19.323 17.902 19.541C18.049 19.834 18.561 20.636 19.366 21.365C20.39 22.24 21.196 22.531 21.488 22.677C21.781 22.823 21.927 22.75 22.073 22.604C22.219 22.459 22.732 21.875 22.878 21.584C23.024 21.293 23.244 21.364 23.463 21.438C23.683 21.511 25 22.167 25.219 22.313C25.512 22.458 25.659 22.531 25.732 22.604C25.805 22.824 25.805 23.334 25.585 23.917Z"
        fill="white"
      />
    </svg>
  );
}

function TelegramIcon() {
  return (
    <svg
      className={styles.telegram}
      width="40"
      height="41"
      viewBox="0 0 40 41"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        d="M20 40.771C31.0457 40.771 40 31.8167 40 20.771C40 9.7253 31.0457 0.770996 20 0.770996C8.9543 0.770996 0 9.7253 0 20.771C0 31.8167 8.9543 40.771 20 40.771Z"
        fill="currentColor"
      />
      <path
        d="M9.35002 21.1452L13.949 22.8602L15.741 28.6272C15.819 29.0172 16.287 29.0942 16.599 28.8602L19.17 26.7562C19.404 26.5232 19.794 26.5232 20.105 26.7562L24.704 30.1072C25.015 30.3412 25.483 30.1852 25.561 29.7962L28.99 13.4302C29.068 13.0402 28.678 12.6502 28.289 12.8062L9.35002 20.1322C8.88202 20.2882 8.88202 20.9892 9.35002 21.1452ZM15.508 22.0022L24.548 16.4692C24.704 16.3912 24.86 16.6252 24.704 16.7032L17.3 23.6392C17.066 23.8732 16.832 24.1852 16.832 24.5742L16.599 26.4442C16.599 26.6782 16.209 26.7562 16.131 26.4442L15.196 23.0162C14.962 22.6262 15.118 22.1582 15.508 22.0022Z"
        fill="white"
      />
    </svg>
  );
}
